CREATE DATABASE IF NOT EXISTS students;
USE students;

CREATE TABLE IF NOT EXISTS students_info (
    id INT PRIMARY KEY AUTO_INCREMENT,
    last_name VARCHAR(50) NOT NULL,
    first_name VARCHAR(50) NOT NULL,
    middle_name VARCHAR(50) NOT NULL,
    birth_date DATE NOT NULL,
    record_book_number VARCHAR(20) UNIQUE NOT NULL
    );


INSERT INTO students_info (last_name, first_name, middle_name, birth_date, record_book_number)
VALUES
    ('Петров', 'Олег', 'Іванович', '2002-05-15', 'KB12345'),
    ('Іванова', 'Марія', 'Олегівна', '2003-07-22', 'KB12346'),
    ('Сидоренко', 'Павло', 'Миколайович', '2004-12-03', 'KB12347'),
    ('Коваленко', 'Анна', 'Сергіївна', '2002-03-10', 'KB12348'),
    ('Смирнов', 'Ігор', 'Васильович', '2002-01-12', 'KB12349'),
    ('Бойко', 'Олена', 'Петрівна', '2003-02-19', 'KB12350'),
    ('Мельник', 'Дмитро', 'Олександрович', '2004-03-25', 'KB12351'),
    ('Левченко', 'Юлія', 'Іванівна', '2002-04-07', 'KB12352'),
    ('Григоренко', 'Віктор', 'Михайлович', '2003-05-14', 'KB12353'),
    ('Ткаченко', 'Наталія', 'Сергіївна', '2004-07-30', 'KB12354'),
    ('Романенко', 'Олексій', 'Володимирович', '2002-08-11', 'KB12355'),
    ('Шевченко', 'Катерина', 'Андріївна', '2003-09-22', 'KB12356'),
    ('Павленко', 'Максим', 'Ігорович', '2004-10-05', 'KB12357'),
    ('Кравець', 'Софія', 'Олегівна', '2002-11-18', 'KB12358'),
    ('Зайцев', 'Артем', 'Вікторович', '2003-12-01', 'KB12359'),
    ('Литвин', 'Марта', 'Ярославівна', '2004-01-27', 'KB12360'),
    ('Дорошенко', 'Іван', 'Павлович', '2002-02-14', 'KB12361'),
    ('Савчук', 'Ольга', 'Миколаївна', '2003-03-09', 'KB12362'),
    ('Кузьменко', 'Роман', 'Степанович', '2004-04-23', 'KB12363'),
    ('Мороз', 'Валерія', 'Денисівна', '2002-05-02', 'KB12364');